Revit 2024 API
Material.SurfaceForegroundPatternColor Property
 The color of the material surface foreground pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public Color SurfaceForegroundPatternColor { get; set; }
Visual Basic
Public Property SurfaceForegroundPatternColor As Color
	Get
	Set
Visual C++
public:
property Color^ SurfaceForegroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Material Class
Autodesk.Revit.DB Namespace